upstream/turek-hron-fsi3-calculix/fluid-openfoam/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    system;
    object      controlDict;
}

application         pimpleFoam;    // OpenFOAM v1806, OpenFOAM 6, or newer
// application         pimpleDyMFoam; // OpenFOAM v1712, OpenFOAM 5.x, or older



libs ( "libOpenFOAM.so" "libgroovyBC.so" ) ;

startFrom           startTime;

startTime           0;

stopAt              endTime;

endTime             20;

deltaT              0.0005;

writeControl        adjustableRunTime;

writeInterval       0.1;

purgeWrite          0;

writeFormat         ascii;

writePrecision      6;

writeCompression    off;

timeFormat          general;

timePrecision       6;

functions
{
    preCICE_Adapter
    {
        type preciceAdapterFunctionObject;
        libs ("libpreciceAdapterFunctionObject.so");
    }


    Forces

    {
      type                forces;
      libs  ("libforces.so");
      writeControl       timeStep;
      writeInterval      1;
      patches             (  flap cylinder  );
      pName               p;
      UName               U;
      rho             rhoInf;
      log                 true;
      rhoInf              1;
      CofR                (0 0 0);
    }

}
