upstream/turek-hron-fsi3-calculix/fluid-openfoam/constant/turbulenceProperties
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location constant;
    object turbulenceProperties;
}

simulationType laminar;
